InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ВыгрузкаИзЦБКурса/Ext/Module.bsl
// Загружает курсы валют из ЦБ РФ и записывает их в регистр сведений
Процедура ЗагрузкаКурсаВалютРегл() Экспорт
	ДатаКурса = ТекущаяДата();
	ВсеКурсы = ВыгрузкаИзЦБКурса.ПолучитьКурсВалют(ДатаКурса); 
	
	Если ВсеКурсы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ Ссылка, КодВалюты КАК Код ИЗ Справочник.Валюты ГДЕ КодВалюты <> """" И КодВалюты <> ""RUB""";
    
    Выборка = Запрос.Выполнить().Выбрать();
    
    Пока Выборка.Следующий() Цикл
        КодДляПоиска = ВРег(СокрЛП(Выборка.Код));
        Курс = ВсеКурсы.Получить(КодДляПоиска);
        
        Если Курс <> Неопределено И Курс > 0 Тогда
            ЗаписатьКурсВРегистр(ДатаКурса, Выборка.Ссылка, Курс);
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры


// Записывает курс валюты в регистр сведений
//
// Параметры:
//   Период - Дата - дата курса валюты
//   Валюта - СправочникСсылка.Валюты - валюта
//   Курс - Число - курс валюты
Процедура ЗаписатьКурсВРегистр(Период, Валюта, Курс) Экспорт
    Менеджер = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
    Менеджер.Период = Период;
    Менеджер.Валюта = Валюта;
    Менеджер.Курс   = Курс;
    Менеджер.Записать();
КонецПроцедуры

 
 // Возвращает курсы валют ЦБ РФ на указанную дату в виде соответствия кода валюты к курсу
 //
 // Параметры:
 //   ДатаКурса - Дата - дата, на которую необходимо получить курсы валют
 //
 // Возвращаемое значение:
 //   Соответствие - код валюты (строка) - курс (число)
 //   Неопределено - при ошибке получения данных
 //   Число - 0 при получении кода состояния HTTP, отличного от 200
 Функция ПолучитьКурсВалют(ДатаКурса) Экспорт
	 
	 Результат = Новый Соответствие;
	 
	 ДатаСтр = Формат(ДатаКурса, "ДФ=dd/MM/yyyy; ПР=/");
	ПутьКФайлу = "/scripts/XML_daily.asp?date_req=" + ДатаСтр;
	
	Попытка
		 //Запрос на сайт
		 Соединение = Новый HTTPСоединение("www.cbr.ru",,,,,, Новый ЗащищенноеСоединениеOpenSSL());
		 Запрос = Новый HTTPЗапрос(ПутьКФайлу);
		 Ответ = Соединение.Получить(Запрос);
		 
		 //200 ок, не 200 плохо
		 Если Ответ.КодСостояния  <> 200 Тогда Возврат 0; КонецЕсли;
		 
		 //Получаем инфу как тело и читаем в пямать
		 ПотокДанных = Ответ.ПолучитьТелоКакПоток();
		 ЧтениеXML = Новый ЧтениеXML;
		 ЧтениеXML.ОткрытьПоток(ПотокДанных);
		 
		 //Запихиваем данные в дерево
		 ПостроительDOM = Новый ПостроительDOM;
		 ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
		 ЧтениеXML.Закрыть();
		 
		 ВсеВалюты = ДокументDOM.ПолучитьЭлементыПоИмени("Valute");
		 
		 Для Каждого Узел из ВсеВалюты Цикл
		 //Получаем данные из узла  
		 Код  = СокрЛП(ВРег(Узел.ПолучитьЭлементыПоИмени("CharCode")[0].ТекстовоеСодержимое)); 
		 Значение = Число(СтрЗаменить(Узел.ПолучитьЭлементыПоИмени("Value")[0].ТекстовоеСодержимое, ",", "."));
		 Номинал  = Число(СтрЗаменить(Узел.ПолучитьЭлементыПоИмени("Nominal")[0].ТекстовоеСодержимое, ",", "."));
		 		 
		 Курс = ?(Номинал > 0, Значение / Номинал, Значение);
	 	 Результат.Вставить(Код, Курс); 
	 КонецЦикла; 
	 Возврат Результат;
	 Исключение
		 
		 ЗаписьЖурналаРегистрации("ЗагрузкаКурса", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		 Возврат Неопределено;
	 КонецПопытки; 
	 КонецФункции
